fio/outputs/testext2orig/fio-rand-write.output
file1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.12
Starting 4 processes
file1: Laying out IO file (1 file / 10240MiB)
file1: Laying out IO file (1 file / 10240MiB)
file1: Laying out IO file (1 file / 10240MiB)
[...]

file1: (groupid=0, jobs=1): err= 0: pid=1760: Mon Jul 27 21:00:10 2020
  write: IOPS=20.0k, BW=78.3MiB/s (82.1MB/s)(68.8GiB/900015msec); 0 zone resets
    slat (nsec): min=872, max=246743k, avg=42734.63, stdev=895597.31
    clat (usec): min=4, max=17380k, avg=749.35, stdev=34601.80
     lat (usec): min=37, max=17380k, avg=792.37, stdev=34612.77
    clat percentiles (usec):
     |  1.00th=[   68],  5.00th=[   87], 10.00th=[   97], 20.00th=[  108],
     | 30.00th=[  116], 40.00th=[  124], 50.00th=[  133], 60.00th=[  141],
     | 70.00th=[  151], 80.00th=[  163], 90.00th=[  190], 95.00th=[  251],
     | 99.00th=[20579], 99.50th=[26084], 99.90th=[31851], 99.95th=[35390],
     | 99.99th=[39584]
   bw (  KiB/s): min=22288, max=406952, per=27.77%, avg=88919.37, stdev=38739.01, samples=1622
   iops        : min= 5572, max=101736, avg=22229.82, stdev=9684.74, samples=1622
  lat (usec)   : 10=0.01%, 50=0.17%, 100=12.60%, 250=82.22%, 500=2.09%
  lat (usec)   : 750=0.31%, 1000=0.05%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%, 20=1.27%, 50=1.26%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.48%, sys=17.64%, ctx=709667, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18030897,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=1761: Mon Jul 27 21:00:10 2020
  write: IOPS=20.1k, BW=78.4MiB/s (82.2MB/s)(68.9GiB/900015msec); 0 zone resets
    slat (nsec): min=882, max=199279k, avg=42878.45, stdev=896185.50
    clat (usec): min=5, max=16702k, avg=747.91, stdev=33094.72
     lat (usec): min=38, max=16702k, avg=791.07, stdev=33106.20
    clat percentiles (usec):
     |  1.00th=[   60],  5.00th=[   85], 10.00th=[   97], 20.00th=[  108],
     | 30.00th=[  116], 40.00th=[  124], 50.00th=[  133], 60.00th=[  141],
     | 70.00th=[  151], 80.00th=[  163], 90.00th=[  190], 95.00th=[  251],
     | 99.00th=[20579], 99.50th=[26084], 99.90th=[31851], 99.95th=[35390],
     | 99.99th=[38536]
   bw (  KiB/s): min=38976, max=405160, per=27.70%, avg=88708.77, stdev=36214.90, samples=1629
   iops        : min= 9744, max=101290, avg=22177.17, stdev=9053.72, samples=1629
  lat (usec)   : 10=0.01%, 50=0.20%, 100=12.79%, 250=82.01%, 500=2.08%
  lat (usec)   : 750=0.28%, 1000=0.05%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=1.27%, 50=1.27%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=2.49%, sys=17.55%, ctx=825983, majf=0, minf=15
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18065467,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=1762: Mon Jul 27 21:00:10 2020
  write: IOPS=19.9k, BW=77.8MiB/s (81.6MB/s)(68.4GiB/900015msec); 0 zone resets
    slat (nsec): min=842, max=265268k, avg=43165.42, stdev=904112.01
    clat (usec): min=4, max=16785k, avg=753.37, stdev=33292.94
     lat (usec): min=39, max=16785k, avg=796.83, stdev=33304.57
    clat percentiles (usec):
     |  1.00th=[   67],  5.00th=[   86], 10.00th=[   96], 20.00th=[  108],
     | 30.00th=[  116], 40.00th=[  124], 50.00th=[  133], 60.00th=[  141],
     | 70.00th=[  151], 80.00th=[  163], 90.00th=[  192], 95.00th=[  258],
     | 99.00th=[20579], 99.50th=[26346], 99.90th=[32113], 99.95th=[35390],
     | 99.99th=[41681]
   bw (  KiB/s): min= 6776, max=410040, per=27.50%, avg=88073.49, stdev=38059.48, samples=1629
   iops        : min= 1694, max=102510, avg=22018.37, stdev=9514.87, samples=1629
  lat (usec)   : 10=0.01%, 50=0.17%, 100=12.98%, 250=81.71%, 500=2.19%
  lat (usec)   : 750=0.30%, 1000=0.06%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=1.27%, 50=1.28%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.48%, sys=17.55%, ctx=736771, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17934512,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=1763: Mon Jul 27 21:00:10 2020
  write: IOPS=20.0k, BW=78.2MiB/s (82.0MB/s)(68.7GiB/900015msec); 0 zone resets
    slat (nsec): min=901, max=265246k, avg=43184.80, stdev=904012.42
    clat (usec): min=4, max=15701k, avg=749.77, stdev=31571.25
     lat (usec): min=37, max=15701k, avg=793.25, stdev=31583.55
    clat percentiles (usec):
     |  1.00th=[   59],  5.00th=[   84], 10.00th=[   96], 20.00th=[  106],
     | 30.00th=[  116], 40.00th=[  124], 50.00th=[  133], 60.00th=[  143],
     | 70.00th=[  153], 80.00th=[  165], 90.00th=[  194], 95.00th=[  265],
     | 99.00th=[20579], 99.50th=[26346], 99.90th=[32113], 99.95th=[35390],
     | 99.99th=[42730]
   bw (  KiB/s): min= 8696, max=406696, per=27.46%, avg=87949.51, stdev=39627.57, samples=1639
   iops        : min= 2174, max=101674, avg=21987.36, stdev=9906.90, samples=1639
  lat (usec)   : 10=0.01%, 50=0.16%, 100=13.17%, 250=81.40%, 500=2.32%
  lat (usec)   : 750=0.30%, 1000=0.06%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%, 20=1.27%, 50=1.28%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.53%, sys=17.60%, ctx=703021, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18020791,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=313MiB/s (328MB/s), 77.8MiB/s-78.4MiB/s (81.6MB/s-82.2MB/s), io=275GiB (295GB), run=900015-900015msec

Disk stats (read/write):
  sda: ios=83/57735667, merge=0/3101, ticks=126/58273315, in_queue=57287864, util=96.48%